""""""
"""
Task 07
ЕГЭ информатика 2025. Полный курс
https://stepik.org/course/195798
"""


""" 19.4 Закрепление """
# https://stepik.org/lesson/1225428/step/7?unit=1238919
"""
I1 = (150 * 150 * i / 2**23) * 0.8 = 4
I2 = (300 * 300 * i / 2**23) * 0.6 = x

I1 = 150**2 * 0.8 == 4
I2 = 300**2 * 0.6 == x
"""
print((300**2 * 0.6 * 4) / (150**2 * 0.8))  # 12


""" 21.4 Закрепление """
# https://stepik.org/lesson/1227125/step/7?unit=1240643
"""
600 * 600 * 24 == 12
300*300 * 16 == x
"""
print((12 * 300*300 * 16) / (600 * 600 * 24))  # 2
