""""""
"""
ОСНОВНАЯ ФОРМУЛА ИНФОРМАТИКИ:

Мощность алфавита - количество символов N можно закодировать с помощью i бит:
N = 2 ** i

ОБЪЕМ ТЕКСТА:
объем текстового сообщения 'I' равен объему одного символа 'i', умноженному на количество символов 'n' в сообщении:
I = i * n
"""

"""
В английском алфавите 26 букв
 5 гласных (A, E, I, O, U) и 21 согласной буквы, 
 хотя буква Y иногда может выступать в роли гласной. 
A, B, C, D, E, F, G, H, I, J, K, L, M, N, O, P, Q, R, S, T, U, V, W, X, Y, Z


В русском алфавите 33 буквы
буквы от А до Я, включая буквы Ё и Ъ, Ь
10 гласных букв: А, О, У, Ы, Э, И, Е, Ё, Ю, Я. 
Эти буквы обозначают 6 основных гласных звуков: [а, о, у, ы, э, и]. 
Буквы Е, Ё, Ю, Я являются йотированными гласными
"""