""" https://kompege.ru/task """
"""
90 152 156 354 359 6891
1551 2669 3885 4319 5247 5662 7672 7695 8416 9154
11226 12239 12461 13093 17520 17548 17980 19239 19364
21702 22475 23366 24127 24128 24620 24887 24981
"""



# 90 Джобс 07.09.2020 (Уровень: Средний)
# 50 Mb --> 90 sec
# ? Mb --> 40 - 16 = 27 sec
print(27 * 50 / 90)  # 15


# 152 (Уровень: Средний) 🙂
v1 = 12  # 60 * 16
v2 = (12 / 3 / 2) * 5
print(v2)  # 10


# 156 (Уровень: Средний) 🙂
from math import ceil
pic = ceil(640 * 480 * 16 / 8)  #  1 фото
serial = pic * 128 / 2**20
print(int(serial))  # 75


# 354 (Уровень: Базовый)
"""
4 * 1 * 1 = 27
2 * 2 / 1.5 = x
"""
x = (2 * 2 * (1 / 1.5)) * 27 / 4
print(x)  # 18


# 359 (Уровень: Средний)
A = 30
B = (A * 2 / 2 / 1.5) / 4
print(B)  # 5


# 6891 OpenFIPI (Уровень: Базовый)
from math import ceil
for i in range(1, 100):
    if ceil(192 * 960 * i / 8) > 90 * (100 / 65) * 1024:
        print(2**(i-1))  # 64
        break








# 1551 (Уровень: Средний)
"""
600 * 600 * 24 = x * 2**23
150 * 150 * 16 = 256 * 2**13
"""
x = 600 * 600 * 24 * 256 * 2**13 / (150 * 150 * 16) / 2**23
print(x)  # 6


# 2669 Пробный 02.2022 (Уровень: Средний)
"""
1920 * 1080 * 15 * n = 40 * 2**23
"""
n = 40 * 2**23 / (1920 * 1080 * 15)
print(int(n))  # 10


# 3885 Джобс 14.05.2022 (Уровень: Средний)
from math import ceil
p1 = ceil(1200 * 1600 * 11 / 8) / 2**10
p2 = p1 * 0.79 + 20
print(ceil(p2 / 1024))  # 3


# 4319 Пробный 06.2022 /dev/inf advanced (Уровень: Базовый)
"""
2 * 44_000 * 135 * i = 1
          10 * 2**23 = 0.7
10 * 2**23 = 2 * 44_000 * 135 * 0.7 * i
"""
i = (10 * 2**23) / (2 * 44_000 * 135 * 0.7)
print(int(i))  # 10


# 5247 (Уровень: Базовый)
"""
4044 * 1028 * (16 + x) = 16 * 2**23
"""
x = (16 * 2**23 / (4044 * 1028)) - 16
print(2**int(x))  # 65536


# 5662 Вариант 09.01.23 (Уровень: Базовый)
from math import ceil
I1 = ceil(960 * 512 * 11 / 8)
I2 = I1 * 100 / 135
print(ceil(I2 / 1024))  # 489


# 7672 (Уровень: Средний)
v = 1920*1080 * 7 * 30 * 134
a = 2 * 30_000 * 8 * 134
I = (v + a + 8 * 1024) * 0.73
print(int(I / 2**23))  # 5083


# 7695 (Уровень: Базовый)
I = 18 * 18_000 * 18 * (18 * 60) / 2**23
print(I)  # 750


# 8416 (Уровень: Средний)
I1 = 2 * 48_000 * 24 * (2**20 / (1.5*2**10)) * 60
I2 = I1 * ((100 - 84) / 100) / 2**23
print(ceil(I2 / 15))  # 120


# 9154 Джобс 06.06.2023 (Уровень: Сложный)
# Ist = 96 * 54 * 600**2 * i / 2**23 == 27
# Ien = 64 * 36 * 300**2 * i/1.5 / 2**23 == ?
i = (27 * 2**23) / (96 * 54 * 600*600)
print((27 - 64 * 36 * 300**2 * i/1.5 / 2**23) * 1024)  # 25600




# 11226 (Уровень: Средний)
I = 2 * 4_000 * 7 * 8  # * sec
V = 86_000 * 56 * 60
sec = V / I
print(sec / 60)  # 11   (10.75 --> 11)


# 12239 ЕГКР 16.12.23 (Уровень: Базовый)
"""
12_582_912 * sec = 1280 * 1024 * 10 * 220
"""
sec = 1280 * 1024 * 10 * 220 / 12_582_912
print(int(sec))  # 229


# 12461 (Уровень: Базовый)
"""
4 * 96_000 * 48 * 5 = 28_800 * sec
"""
sec = (4 * 96_000 * 48 * 5) / 28_800
print(int(sec))  # 3200


# 13093 (Уровень: Средний) 👍
from math import ceil, log2
i = ceil(log2(65536))  # 16
for n in range(1, 100):
    if ((1200 * 800 * 16 / 8) * 0.6) <= 300 * 2**10 * n:
        print(n)  # 4
        break


# 17520 Основная волна 07.06.24 (Уровень: Базовый)
from math import log2  # log2(8192) = 13
"""
1024 * 960 * log2(8192) * n = 1_474_560 * 280
"""
n = 1_474_560 * 280 / (1024 * 960 * log2(8192))
print(int(n))  # 32


# 17548 Основная волна 08.06.24 (Уровень: Базовый)
"""
I = 1024 * 960 * 11 * n
V = 96_468_992 * 280
"""
n = (96_468_992 * 280) / (1024 * 960 * 11)
print(int(n))  # 2497


# 17980 (Уровень: Средний)
album = 2 * 44_000 * 16 * (45 * 60) + (15 * 55 * 2**13)
sec = album / 245839600
print(int(sec))  # 15


# 19239 ЕГКР 21.12.24 (Уровень: Базовый)
from math import ceil, log2
foto = ceil(3840 * 2160 * 24 / 8)
sd = (16 * 2**30) // foto  # 690 шт.
print(3742 % sd)  # 292 шт.


# 19364 (Уровень: Средний)
from math import ceil
foto = ceil(1280 * 1024 * 8 / 8)
sd = (4 * 2**30) // foto  # 3276 шт.
print(8921742524 % sd)  # 2060 шт.





"""✅✅✅"""

# 21702 ЕГКР 19.04.25 (Уровень: Базовый)
from math import ceil
sd = (9 * 2**30) // ceil(7680 * 4320 * 16 / 8)  # кол-во снимков на одной карте памяти
print(4010 % sd)  # осталось на последней карте памяти


# 22475 (Уровень: Средний)
V1 = 3840 * 2160 * 20 * 60 * 30 / 2**33
A1 = 2 * 48_000 * 16 * 30 / 2**33
I1 = (V1 + A1) * 3
V2 = 1920 * 1080 * 16 * 60 * 30 / 2**33
A2 = 2 * 36_000 * 8 * 30 / 2**33
I2 = (V2 + A2) * 3
print(int(I1 - I2))  # 83


# 23366 Резервный день 19.06.25 (Уровень: Базовый)
I = 2560 * 1440 * 30 / 2**13
Iz = 1920 * 1080 * 28 / 2**13
# I = 2560 * 1440 * 30 / 8 / 1024
# Iz = 1920 * 1080 * 28 / 8 / 1024
print(int((I - Iz) * 130))  # 833625


# 24127 (Уровень: Средний)
photo = ((4096 * 8192 * 24 / 8) * 0.65 + 64 * 2**10) / 2**30
print(int(5 / photo))  # 81


# 24128 (Уровень: Средний)
from math import ceil
r = ((3840 * 2160 * 24 / 8) * 0.65 + 120 * 1024) / 2**30
print(ceil(r * 4320 / 20))  # 4


# 24620 (Уровень: Сложный)
"""
1_SD = 300 - 1  = 299 шт.  (1200 / 4) + 1 on SD_5
3840 * 5160 * 24 * 300 * 100 / n = 4 * 2**33
"""
n = 1200
if n % 4:
    sd = n // 4 + 1
else:
    sd = n // 4
for i in range(100, 0, -1):
    if 3840 * 5160 * 24 * sd * ((100 - i) / 100) > 4 * 2**33:  # как только не умещается 300-е фото...
        print(i)  # 75
        break


# 24887 (Уровень: Средний)
for h in range(10**5, 10**6):
    t = (2 * 56_000 * 15 * (27 * 60 + 27) + 28 * h * 2**13) / 367_217_732
    if t > 332:
        print(h)  # 519450 KB (автор шутит)
        break
# variant
S = 367_217_732 * 332 / 2**13  # весь файл
for z in range(10**5, 10**6):
    if 2 * 56_000 * 15 * (27 * 60 + 27) / 2**13 + z * 28 > S:
        print(z)  # 519450 KB (автор шутит)
        break


# 24981 (Уровень: Средний)
I_1 = 1080 * 1920 * 12 * 60 * 57 / 2**13
I_2 = 1080 * 1920 * 11 * 24 * 57 / 2**13
print(I_1 - I_2)  # 6579225




""" Другие источники (для моего курса) """
# https://stepik.org/lesson/564202/step/6?unit=558450
# https://alex-math.ru/gia/zadaniye-7-informatika-yege-polyakov-5370
# Поляков 5370 (ЕГЭ-2022)
from math import ceil
for i in range(1, 100):
    # if ceil(640 * 256 * i / 8) * (100 / 135) > 170 * 1024:
    if ceil(640 * 256 * i / 8) > 170 * 1024 * 1.35:
        print(2**(i - 1)) # 2048
        break

# https://stepik.org/lesson/564202/step/10?unit=558450
A = 72
B = (A * 2**2 / 3) / 3  # 2**2  (с разрешением в 2 раза больше)
print(B)  # 32

# https://alex-math.ru/gia/zadaniye-7-informatika-yege-polyakov-1816
# Поляков-1816
A = 30
B = (A * 3**2 / 2) / 1.5  # 3**2  (с разрешением в 3 раза больше)
print(B)  # 90