""" https://kompege.ru/task """
"""
90 152 154 156 354 359 490 664 771 821 
1240 1551 1553 1554 1556 1746 2568 2569 2669 2853 3885 4319 4464 5060 5244 5247 5487 5662 5872 
6356 6891 6928 7672 7695 8416 9154 9362 
11226 12239 12461 13093 15435 16318 16373 17520 17548 17626 17670 17861 17979 17980 18613 19239 19364 
20804 21406 21702 22475 23366 23553 24127 24128 24620 24887 24981 29960
"""



# 90 Джобс 07.09.2020 (Уровень: Средний)
# 50 Mb --> 90 sec
# ? Mb --> 40 - 16 = 27 sec
print(27 * 50 / 90)  # 15


# 152 (Уровень: Средний) 🙂
v1 = 12  # 60 * 16
v2 = (12 / 3 / 2) * 5
print(v2)  # 10


# 154 (Уровень: Средний)
# 600**2 * 24 = 12
# 300**2 * 8 = x
x = 300**2 * 8 * 12 / (600**2 * 24)
print(x)  # 1


# 156 (Уровень: Средний) 🙂
from math import ceil
pic = ceil(640 * 480 * 16 / 8)  #  1 фото
serial = pic * 128 / 2**20
print(int(serial))  # 75


# 354 (Уровень: Базовый)
"""
4 * 1 * 1 = 27
2 * 2 / 1.5 = x
"""
x = (2 * 2 * (1 / 1.5)) * 27 / 4
print(x)  # 18


# 359 (Уровень: Средний)
A = 30
B = (A * 2 / 2 / 1.5) / 4
print(B)  # 5


# 490 Джобс 19.10.2020(Уровень: Сложный)
from math import ceil
for p in range(1, 1000):
    if ceil(4*3 * p**2 * 12 / 8) > 320 * 1024:
        print(4*3 * (p-1)**2)  # 215472
        break


# 664 Джобс 09.11.2020(Уровень: Средний)
# 600**2 * 24 = x
# 300**2 * 4 = 128
x = 600**2 * 24 * 128 / (300**2 * 4)
print(x / 1024)  # 3


# 771 Джобс 30.11.2020(Уровень: Сложный)
from math import ceil
for i in range(1, 100):
    if ceil(1600 * 1200 * i / 8) * 8 * 20 > 2**23 * 10:
        print(2**(i-1))  # 4
        break


# 821 Джобс 14.12.2020(Уровень: Сложный)
from math import ceil
I = ceil(1600 * 1200 * 11 / 8) * 8  # bit
p_12 = 2**24  * 10 // I  # 7 фото за 10 сек (== за 12 сек)
p_36 = p_12 * (40 // 12)  # 21 фото за 36 сек
ost = 2**24 * (40 % 12) // I  # 3 фото за 4 сек
print(p_36 + ost)  # 24



# 1551 (Уровень: Средний)
"""
600 * 600 * 24 = x * 2**13_(23)
150 * 150 * 16 = 256 * 2**13
"""
x = 600 * 600 * 24 * 256 * 2**13 / (150 * 150 * 16) / 2**23
print(x)  # 6


# 1553 (Уровень: Средний)
I = 512 * 192 * 8 / 2**23
print(I * 6 * 60 * 24)  # 810


# 1554 (Уровень: Средний)
"""
I1 = 300**2 * 16 == 18
I2 = 200**2 * 8 == x
"""
print(200**2 * 8 * 18 / (300**2 * 16))  # 4



# 1556 (Уровень: Средний)
"""
решаем от файла прогнанного по каналу Б
Va = 12 * 5
Ib = Ia * 3 / 2
файл Ib прогонится по каналу "А" за 60 сек. Но файл Ia = Ib * 2 / 3
t = (12 * 5) * (2 / 3)
"""
print(12 * 5 * 2 / 3)  # 40 sec


# 1746 (Уровень: Сложный)
from math import ceil, pi
# Площадь сферы 4 * Pi * r**2
moon = 4 * pi * (1737.1 * 10_000)**2  # площадь в дециметрах
I = moon * 8 / 8   # byte
print(ceil(I / 10**12))  # 3792 Тбайт в десятичной системе !!!


# 2568 (Уровень: Средний)
from math import ceil
I = ceil(4 * 7 * 300**2 * 24 / 8) + 6*1024
print(640 * 2**20 // I)


# 2569 (Уровень: Средний)
from math import ceil
I = ceil(3 * 4 * 300**2 * 16 / 8) + 4*1024
print(ceil(I / 1024))  # 2114


# 2669 Пробный 02.2022 (Уровень: Средний)
"""
1920 * 1080 * 15 * n = 40 * 2**13_(23)
"""
n = 40 * 2**23 / (1920 * 1080 * 15)
print(int(n))  # 10


# 2853 Статград 08.02.2022(Уровень: Средний) ✔️✔️✔️
I = 320 * 240 * 8 / 8
for n in range(1, 1000):
    if I * (3600 // n) < 27 * 2**20:  #  3600 // n  - суть расчета
        print(n)  # 10
        break


# 3885 Джобс 14.05.2022 (Уровень: Средний)
from math import ceil
p1 = ceil(1200 * 1600 * 11 / 8) / 2**10
p2 = p1 * 0.79 + 20
print(ceil(p2 / 1024))  # 3

# variant
I = ceil(1200 * 1600 * 11 / 8) * ((100 - 21) / 100) + 20 * 1024
print(ceil(I / 2**20))  # 3



# 4319 Пробный 06.2022 /dev/inf advanced (Уровень: Базовый)
"""
2 * 44_000 * 135 * i = 1
          10 * 2**13_(23) = 0.7
10 * 2**13_(23) = 2 * 44_000 * 135 * 0.7 * i
"""
i = (10 * 2**23) / (2 * 44_000 * 135 * 0.7)
print(int(i))  # 10


# 4464 Джобс 15.06.2022(Уровень: Средний)
from math import ceil
I = ceil(192 * 960 * 11 / 8 ) / 1024
press = 180 * 100 / I
print(ceil(100 - press))  # 28


# 5060 (Уровень: Средний)
for hz in range(1, 10**10):
    if 160 / 4 / 2 * (hz /44) == 10:
        print(hz)  # 22
        break
# var
print(int(10 * 4 * 2 * 44 / 160))  # 22


# 5244 (Уровень: Средний)
I1 = 15
I2 = I1 * 2 * 4  * 0.9 / 2
print(I2)  # 54


# 5247 (Уровень: Базовый)
"""
4044 * 1028 * (16 + x) = 16 * 2**13_(23)
"""
x = (16 * 2**23 / (4044 * 1028)) - 16
print(2**int(x))  # 65536


# 5487 (Уровень: Средний)
I1 = 15 * (100 / (100 - 25))  # 20  исходный размер
I2 = I1 * (300 / 200)**2 * ((100 - 40) / 100)  # сжатый размер
print(I2)  # 27



# 5662 Вариант 09.01.13_(23) (Уровень: Базовый)
from math import ceil
I1 = ceil(960 * 512 * 11 / 8)
I2 = I1 * 100 / 135
print(ceil(I2 / 1024))  # 489


# 5872 Danov2301(Уровень: Сложный)
from math import ceil, log2
i = ceil(log2(16 * 10**6))  # 24
I = ceil(3840 * 2160 * i / 8)
SSD = 10**12 * 1_000
t = SSD /(I * 60 * 3600)
print(int(t))


# 6356 (Уровень: Средний)
A = 2 * 66_000 * 32 / 2
B = 2 * 44_000 * 16 / 12
sec = (11 * 12 * 2**23) / (2 * 44_000 * 16)
print(A * sec / 2**23)  # 198


# 6891 OpenFIPI (Уровень: Базовый)
from math import ceil
for i in range(1, 100):
    if ceil(192 * 960 * i / 8) > 90 * (100 / 65) * 1024:
        print(2**(i-1))  # 64
        break


# 6928 (Уровень: Средний)
foto = 2  # Mb
print_foto = 10  # sec
get_foto = foto / (4 / 8)  #  (convert Mbit to Mb) 4 sec
# print_foto > get_foto
total = get_foto + print_foto * 20
print(total)  # 204  sec


# 7672 (Уровень: Средний)
v = 1920*1080 * 7 * 30 * 134
a = 2 * 30_000 * 8 * 134
I = (v + a + 8 * 1024) * 0.73
print(int(I / 2**23))  # 5083


# 7695 (Уровень: Базовый)
I = 18 * 18_000 * 18 * (18 * 60) / 2**23
print(I)  # 750


# 8416 (Уровень: Средний)
I = 2 * 48_000 * 24 * (2**20 / (1.5 * 1024)) * 60
I_zip = I * ((100 - 84) / 100) / 2**23
print(I_zip / 15)  # 120  # 120


# 1240 Статград 26.04.2021(Уровень: Сложный)
# НЕзависимое кодированием каждого пикселя -> каждый пиксель кодируется одинаково
# зависимое кодированием каждого пикселя -> каждый пиксель кодируется индивидуально
from math import ceil, log2
for i in range(1, 1000):
    if (ceil(2048 * 1536 * i / 8) / 4 + 128 * 1024) * 32 == 16 * 2**20:
        print(2**i)  # 16
        break


# 9154 Джобс 06.06.2023 (Уровень: Сложный)
# orig =  96 * 54 * 600**2 == 27
# press = 64 * 36 * 300**2 / 1.5 == x
x = (27 * 64 * 36 * 300**2 / 1.5)  /  (96 * 54 * 600**2)
print((27 - x) * 1024)  # 25600


# 9362 Джобс 10.06.23(Уровень: Средний)
I1 = 4 * 2**23
I2 = I1 * (100 / 140) * 1.5 / 2 / 2
print(int(I2 / 5040))  # 1783



# 11226 (Уровень: Средний)
I = 2 * 4_000 * 7 * 8  # * sec
V = 86_000 * 56 * 60
sec = V / I
print(sec / 60)  # 11   (10.75 --> 11)


# 12239 ЕГКР 16.12.13_(23) (Уровень: Базовый)
"""
12_582_912 * sec = 1280 * 1024 * 10 * 220
"""
sec = 1280 * 1024 * 10 * 220 / 12_582_912
print(int(sec))  # 229


# 12461 (Уровень: Базовый)
"""
4 * 96_000 * 48 * 5 = 28_800 * sec
"""
sec = (4 * 96_000 * 48 * 5) / 28_800
print(int(sec))  # 3200


# 13080 (Уровень: Базовый)
for i in range(1, 100):
    if 2 * 32_000 * i * (100 - 68) / 100 > 40 * 2**13:
        print(i-1)  # 16
        break


# 13093 (Уровень: Средний) 👍
from math import ceil, log2
i = ceil(log2(65536))  # 16
for n in range(1, 100):
    if ceil(1200 * 800 * 16 / 8) * (60/100) <= 300 * 1024 * n:
        print(n)  # 4
        break




# 16318 Открытый вариант 2024(Уровень: Базовый)
from math import ceil
for sec in range(1, 1000):
    if 14_680_064 * sec > ceil(1024 * 960 * 13 / 8) * 8 * 160:
        print(sec - 1)  # 139
        break


# 16373 ЕГКР 27.04.24(Уровень: Базовый)
from math import ceil
for i in range(1, 100):
    if ceil(1280 * 960 * i / 8) * (85/100) > 920 * 1024:
        print(2**(i-1))  # 128
        break


# 17520 Основная волна 07.06.24 (Уровень: Базовый)
from math import ceil
I = ceil(1024 * 960 * 13 / 8) * 8
print(1_474_560 * 280 // I)  # 32
# variant
from math import log2  # log2(8192) = 13
# 1024 * 960 * log2(8192) * n = 1_474_560 * 280
n = 1_474_560 * 280 / (1024 * 960 * log2(8192))
print(int(n))  # 32


# 17548 Основная волна 08.06.24 (Уровень: Базовый)
"""
I = 1024 * 960 * 11 * n
V = 96_468_992 * 280
"""
n = (96_468_992 * 280) / (1024 * 960 * 11)
print(int(n))  # 2497

from math import ceil
V = 96_468_992
for n in range(1, 10000):
    if ceil(1024 * +960 * 11 / 8) * 8 * n > V * 280:
        print(n - 1)  # 2497
        break


# 17626 Основная волна 19.06.24(Уровень: Базовый)
from math import ceil
V = 1_966_080
for i in range(1, 100):
    if ceil(1280 * 1024 * i / 8) * 8 * 39 > V * 280:
        print(2**(i-1))  # 1024
        break


# 17861 Демоверсия 2025(Уровень: Базовый)
from math import ceil
I = ceil(1024 * 768 * 12 / 8)
pack = 1_310_720 * 300 // 8
print(pack // I)  # 41


# 17670 Пересдача 04.07.24(Уровень: Базовый)
from math import ceil, log2
pack = 1_474_560 * 140 // 8
for i in range(1, 100):
    if ceil(1024 * 960 * i / 8) * 32 > pack:
        print(2**(i-1))  # 64
        break


# 17979 Основная волна 07.06.24(Уровень: Средний)
from math import ceil
V = 314_572_800
I = (2 * 48_000 * 34 * 42 * 60 + 30) + (13 * 110 * 2**13)
print(I // V)  # 26


# 17980 (Уровень: Средний)
album = (2 * 44_000 * 16 * 45 * 60) + (15 * 55 * 2**13)
sec = album / 245839600
print(int(sec))  # 15


# 18613 (Уровень: Средний)
from math import ceil
I = ceil(1536 * 1024 * 12 / 8)
pack = I * 150 / 1024
V = 288 * 240
press = 100 * V / pack
print(int(100 - press))  # 80


# 19239 ЕГКР 21.12.24 (Уровень: Базовый)
from math import ceil, log2
foto = ceil(3840 * 2160 * 24 / 8)
sd = (16 * 2**30) // foto  # 690 шт.
print(3742 % sd)  # 292 шт.


# 19364 (Уровень: Средний)
from math import ceil
foto = ceil(1280 * 1024 * 8 / 8)
sd = (4 * 2**30) // foto  # 3276 шт.
print(8921742524 % sd)  # 2060 шт.


# 20804 Апробация 05.03.25(Уровень: Базовый)
from math import ceil
I = ceil(1280 * 960 * 11 / 8) * 8
V = 96_468_992 * 132
for n in range(1, 1000):
    if I * n > V:
        print(n - 1)  # 942
        break


# 21406 Досрочная волна 2025(Уровень: Базовый)
from math import ceil
I1 = ceil(3840 * 2160 * 17 / 8)
I2 = ceil(1280 * 720 * 5 / 8)
print((I1 - I2) * 120 / 1024)  # 1998000


# 21702 ЕГКР 19.04.25 (Уровень: Базовый)
from math import ceil
I = ceil(7680 * 4320 * 16 / 8) / 2**30
sd = 9 // I  # кол-во снимков на одной карте памяти
print(4010 % sd)  # 95 осталось на последней карте памяти


# 22475 (Уровень: Средний)
V1 = 3840 * 2160 * 20 * 60 * 30 / 2**33
A1 = 2 * 48_000 * 16 * 30 / 2**33
I1 = (V1 + A1) * 3
V2 = 1920 * 1080 * 16 * 60 * 30 / 2**33
A2 = 2 * 36_000 * 8 * 30 / 2**33
I2 = (V2 + A2) * 3
print(int(I1 - I2))  # 83


# 23366 Резервный день 19.06.25 (Уровень: Базовый)
I = 2560 * 1440 * 30 / 2**13
Iz = 1920 * 1080 * 28 / 2**13
# I = 2560 * 1440 * 30 / 8 / 1024
# Iz = 1920 * 1080 * 28 / 8 / 1024
print(int((I - Iz) * 130))  # 833625


# 23553 Пересдача 03.07.25(Уровень: Базовый)
from math import ceil
I1 = ceil(1920 * 1080 * 32 / 8) / 1024
I2 = ceil(1280 * 1024 * 30 / 8) / 1024
print(int((I1 - I2) * 120))  # 396000


# 24127 (Уровень: Средний)
photo = ((4096 * 8192 * 24 / 8) * 0.65 + 64 * 2**10) / 2**30
print(int(5 / photo))  # 81


# 24128 (Уровень: Средний)
from math import ceil
r = ((3840 * 2160 * 24 / 8) * 0.65 + 120 * 1024) / 2**30
print(ceil(r * 4320 / 20))  # 4


# 24620 (Уровень: Сложный)
"""
1_SD = 300 - 1  = 299 шт.  (1200 / 4) + 1 on SD_5
3840 * 5160 * 24 * 300 * 100 / n = 4 * 2**33
"""
n = 1200
if n % 4:
    sd = n // 4 + 1
else:
    sd = n // 4
for i in range(100, 0, -1):
    if 3840 * 5160 * 24 * sd * ((100 - i) / 100) > 4 * 2**33:  # как только не умещается 300-е фото...
        print(i)  # 75
        break


# 24887 (Уровень: Средний)
for h in range(10**5, 10**6):
    t = (2 * 56_000 * 15 * (27 * 60 + 27) + 28 * h * 2**13) / 367_217_732
    if t > 332:
        print(h)  # 519450 KB (автор шутит)
        break
# variant
S = 367_217_732 * 332 / 2**13  # весь файл
for z in range(10**5, 10**6):
    if 2 * 56_000 * 15 * (27 * 60 + 27) / 2**13 + z * 28 > S:
        print(z)  # 519450 KB (автор шутит)
        break


# 24981 (Уровень: Средний)
I_1 = 1080 * 1920 * 12 * 60 * 57 / 2**13
I_2 = 1080 * 1920 * 11 * 24 * 57 / 2**13
print(I_1 - I_2)  # 6579225


# 29960 Апробация 14.05.26(Уровень: Базовый)
from math import ceil
I1 = ceil(1024 * 768 * 30 / 8) / 1024
I2 = ceil(800 * 600 * 28 / 8) / 1024
print(int((I1 - I2) * 100))  # 123937




""" Другие источники (для моего курса) """
# https://stepik.org/lesson/564202/step/6?unit=558450
# https://alex-math.ru/gia/zadaniye-7-informatika-yege-polyakov-5370
# Поляков 5370 (ЕГЭ-2022)
from math import ceil
for i in range(1, 100):
    # if ceil(640 * 256 * i / 8) * (100 / 135) > 170 * 1024:
    if ceil(640 * 256 * i / 8) > 170 * 1024 * 1.35:
        print(2**(i - 1)) # 2048
        break

# https://stepik.org/lesson/564202/step/10?unit=558450
A = 72
B = (A * 2**2 / 3) / 3  # 2**2  (с разрешением в 2 раза больше)
print(B)  # 32

# https://alex-math.ru/gia/zadaniye-7-informatika-yege-polyakov-1816
# Поляков-1816
A = 30
B = (A * 3**2 / 2) / 1.5  # 3**2  (с разрешением в 3 раза больше)
print(B)  # 90