""" https://kompege.ru/task """
"""
354 8416
13093 1551 2669 4319 5247 7672 7695 9154
11226 12239 12461 17520 17548
22475 23366 24127 24128 24620 24887 24981
"""


# № 354 (Уровень: Базовый)
"""
4 * 1 * 1 = 27
2 * 2 / 1.5 = x
"""
x = (2 * 2 * (1 / 1.5)) * 27 / 4
print(x)  # 18


# 8416 (Уровень: Средний)
t = 2**10 / 1.5 * 60  # длительность озвучки книги 40960 sec
I = 2 * 48_000 * 24 * t / 8
print((I * 0.16 / 2**20) / 15)  # 120



# 13093 (Уровень: Средний) 👍
from math import ceil, log2
i = ceil(log2(65536))  # 16
for n in range(1, 100):
    if ((1200 * 800 * 16 / 8) * 0.6) <= 300 * 2**10 * n:
        print(n)  # 4
        break


# 1551 (Уровень: Средний)
"""
600 * 600 * 24 = x * 2**23
150 * 150 * 16 = 256 * 2**13
"""
x = 600 * 600 * 24 * 256 * 2**13 / (150 * 150 * 16) / 2**23
print(x)  # 6


# 2669 Пробный 02.2022 (Уровень: Средний)
"""
1920 * 1080 * 15 * n = 40 * 2**23
"""
n = 40 * 2**23 / (1920 * 1080 * 15)
print(int(n))  # 10

# 4319 Пробный 06.2022 /dev/inf advanced (Уровень: Базовый)
"""
2 * 44_000 * 135 * i = 1
          10 * 2**23 = 0.7
10 * 2**23 = 2 * 44_000 * 135 * 0.7 * i
"""
i = (10 * 2**23) / (2 * 44_000 * 135 * 0.7)
print(int(i))  # 10


# 5247 (Уровень: Базовый)
"""
4044 * 1028 * (16 + x) = 16 * 2**23
"""
x = (16 * 2**23 / (4044 * 1028)) - 16
print(2**int(x))  # 65536


# 7672 (Уровень: Средний)
v = 1920*1080 * 7 * 30 * 134
a = 2 * 30_000 * 8 * 134
I = (v + a + 8 * 1024) * 0.73
print(int(I / 2**23))  # 5083


# 7695 (Уровень: Базовый)
I = 18 * 18_000 * 18 * (18 * 60) / 2**23
print(I)  # 750


# 9154 Джобс 06.06.2023 (Уровень: Сложный)
# Ist = 96 * 54 * 600**2 * i / 2**23 == 27
# Ien = 64 * 36 * 300**2 * i/1.5 / 2**23 == ?
i = (27 * 2**23) / (96 * 54 * 600*600)
print((27 - 64 * 36 * 300**2 * i/1.5 / 2**23) * 1024)  # 25600




# 11226 (Уровень: Средний)
I = 2 * 4_000 * 7 * 8  # * sec
V = 86_000 * 56 * 60
sec = V / I
print(sec / 60)  # 11   (10.75 --> 11)


# 12239 ЕГКР 16.12.23 (Уровень: Базовый)
"""
12_582_912 * sec = 1280 * 1024 * 10 * 220
"""
sec = 1280 * 1024 * 10 * 220 / 12_582_912
print(int(sec))  # 229


# 12461 (Уровень: Базовый)
"""
4 * 96_000 * 48 * 5 = 28_800 * sec
"""
sec = (4 * 96_000 * 48 * 5) / 28_800
print(int(sec))  # 3200


# 17520 Основная волна 07.06.24 (Уровень: Базовый)
from math import log2  # log2(8192) = 13
"""
1024 * 960 * log2(8192) * n = 1_474_560 * 280
"""
n = 1_474_560 * 280 / (1024 * 960 * log2(8192))
print(int(n))  # 32


# 17548 Основная волна 08.06.24 (Уровень: Базовый)
"""
I = 1024 * 960 * 11 * n
V = 96_468_992 * 280
"""
n = (96_468_992 * 280) / (1024 * 960 * 11)
print(int(n))  # 2497




# 22475 (Уровень: Средний)
V1 = 3840 * 2160 * 20 * 60 * 30 / 2**33
A1 = 2 * 48_000 * 16 * 30 / 2**33
I1 = (V1 + A1) * 3
V2 = 1920 * 1080 * 16 * 60 * 30 / 2**33
A2 = 2 * 36_000 * 8 * 30 / 2**33
I2 = (V2 + A2) * 3
print(int(I1 - I2))  # 83


# 23366 Резервный день 19.06.25 (Уровень: Базовый)
I = 2560 * 1440 * 30 / 2**13
Iz = 1920 * 1080 * 28 / 2**13
# I = 2560 * 1440 * 30 / 8 / 1024
# Iz = 1920 * 1080 * 28 / 8 / 1024
print(int((I - Iz) * 130))  # 833625


# 24127 (Уровень: Средний)
photo = ((4096 * 8192 * 24 / 8) * 0.65 + 64 * 2**10) / 2**30
print(int(5 / photo))  # 81


# 24128 (Уровень: Средний)
from math import ceil
r = ((3840 * 2160 * 24 / 8) * 0.65 + 120 * 1024) / 2**30
print(ceil(r * 4320 / 20))  # 4


# 24620 (Уровень: Сложный)
"""
1_SD = 300 - 1  = 299 шт.  (1200 / 4) + 1 on SD_5
3840 * 5160 * 24 * 300 * 100 / n = 4 * 2**33
"""
n = 1200
if n % 4:
    sd = n // 4 + 1
else:
    sd = n // 4
for i in range(100, 0, -1):
    if 3840 * 5160 * 24 * sd * ((100 - i) / 100) > 4 * 2**33:  # как только не умещается 300-е фото...
        print(i)  # 75
        break


# 24887 (Уровень: Средний)
for h in range(10**5, 10**6):
    t = (2 * 56_000 * 15 * (27 * 60 + 27) + 28 * h * 2**13) / 367_217_732
    if t > 332:
        print(h)  # 519450 KB (автор шутит)
        break
# variant
S = 367_217_732 * 332 / 2**13  # весь файл
for z in range(10**5, 10**6):
    if 2 * 56_000 * 15 * (27 * 60 + 27) / 2**13 + z * 28 > S:
        print(z)  # 519450 KB (автор шутит)
        break


# 24981 (Уровень: Средний)
I_1 = 1080 * 1920 * 12 * 60 * 57 / 2**13
I_2 = 1080 * 1920 * 11 * 24 * 57 / 2**13
print(I_1 - I_2)  # 6579225

