""" https://kompege.ru/task """
"""
23750 23849 23850 23859
25010 25011 25012 25013 25017 25019 25020 25021 25022 25023 25024 25025❌ 
25071 25072 25073 25293 25301 25302 25351 25599 25606 
26348 27624
"""


# 23750 Демоверсия 2026 (Уровень: Средний)
s_in = '0'*342 + '1' + '0'*657  # 342 + 657 = 999
s_out = '0'*342 + '0' + '1'*657  # 343
print(999)


# 23849 (Уровень: Средний)
# На каждую '2' приходится две '1'  =>  2+1+1=4   => 448 / 4 = 112 групп '211'
s_out = '211' * 112 + '0' * (1000 - 112*3)  # 664 нуля
# Каждый '0' на выходе - это  '1' на входе


# 23850 (Уровень: Базовый)
s_in = '1' * 800 + '0' * 900 + '2'
s_out = '0' * 800 + '1' * 900 + '0'  # 900
"""
Руками 😉. Первое изменение будет в q1, следующее в q0. При этом все нули станут единицами и наоборот.
Значит '1' станет 900
Символов '0' и '1' в строке чётное кол-во, 
значит '2' окажется в программе q1 при которой '2' -> '0'
Ответ: 900
"""
s = '1' * 800 + '0' * 900 + '2'
r = ''
c = 0  # чётное значение == q1, нечётное == q0
for i in s:
    if i != '2':
        r += '01'[i == '0']
        c += 1
    else:
        r += '01'[c % 2]
print(r.count('1'))  # 900


# 23859 (Уровень: Базовый)
for n in range(1, 999):
    s1 = n * (0+1) + (1000 - 2*n) * (2)  # (0+1) и (2)  символы (сумма значений) в исходной строке
    s2 = n * (1+2) + (1000 - 2*n) * (0)  # (1+2) и (0)  символы (сумма значений) в конечной строке
    if s1 - s2 == 200:
        print(1000 - 2*n)  # 400

# ручной вариант
# количество символов 0 и 1 в исходной строке было одинаково
# значит количество символов 1 и 2 в выходной строке тоже одинаково
s_in =  '2' * 400 + '01' * 300  # сумма 2*400 + 1*300 = 1100
s_out = '0' * 400 + '12' * 300  # сумма 0*400 + 3*300 = 900  (разница 200)









# 25010 (Уровень: Базовый)
s = f'{135:b}'
r = ''.join(['0' if i == '1' else '1' for i in s])
print(int(r, 2))  # 120


# 25011 (Уровень: Базовый)
s = f'{400:b}'
r = ''.join('1' if i == '0' else '0' for i in s)
print(int(r, 2))  # 111


# 25012 (Уровень: Базовый)
s = f'{375:b}'[::-1]
r = ''.join('1' if i=='0' else '0' for i in s)
print(int(r[::-1], 2))  # 136


# 25013 (Уровень: Базовый)
for n in range(1000):
    s = f'{n:b}'
    r = ''.join(['0' if i == '1' else '1' for i in s])
    if int(r, 2) == 27:
        print(n)  # 36
        break


# 25017 (Уровень: Базовый)
s = '0' * 151
q = 1
r = ''
for i in s:
    if q == 1:
        r += i
        q = (2, 3)[i == '0']
    elif q == 3:
        r += i
        q = 2
    else:
        r += '01'[i == '0']
        q = 3
print(r.count('1'))  # 75


# 25019 (Уровень: Базовый)
s = '1' * 221
r = ''
q = 1
for i in s:
    if q == 1:
        r += i
        q = 3
    elif q == 3:
        r += i
        q = 2
    else:
        r += '01'[i == '0']
        q = (1, 3)[i == '0']
print(r.count('1'))  # 148


# 25020 (Уровень: Базовый)
s = '0' * 12 + '1' * 15
r = ''
fl = 1
for i in s[::-1]:
    if fl == 1:
        r += i
        fl = 2
    elif fl == 3:
        r += i
        fl = 1
    else:
        r += '01'[i == '0']
        fl = 3
print(r.count('0'))  # 13
# руками
"""
3213213213213213213213213210  # программы
000000000000111111111111111
0_00_00_00_0_0__0__0__0__0_
"""


# 25021 (Уровень: Базовый)
# Без создания выходной строки ✅
s = '1'*30 + '0'*45
c, q = 0, 1
for i in s:
    if q == 1:
        c += int(i)
        q = 2
    elif q == 2:
        c += not int(i)
        q = 3
    else:
        c += int(i)
        q = (1, 2)[i == '0']
print(c)  # 42

# Через создание выходной строки
s = '1'*30 + '0'*45
r = ''
q = 1
for i in s:
    if q == 1:
        r += i
        q = 2
    elif q == 2:
        r += '01'[i == '0']
        q = 3
    else:
        r += i
        q = (1, 2)[i == '0']
print(r.count('1'))  # 42


# 25022 (Уровень: Базовый)
# Без создания выходной строки ✅
s = '1'*21 + '0'*45
c, q = 0, 1
for i in s:
    if q == 1:
        c += int(i)
        q = (3, 2)[i == '0']
    elif q == 2:
        c += 1
        q = (1, 3)[i == '0']
    else:
        q = (2, 1)[i == '0']
print(c)  # 29

# Через создание выходной строки
s = '1'*21 + '0'*45
r = ''
q = 1
for i in s:
    if q == 1:
        r += '01'[i == '0']
        q = (3, 2)[i == '0']
    elif q == 2:
        r += '0'
        q = (1, 3)[i == '0']
    else:
        r += '1'
        q = (2, 1)[i == '0']
print(r.count('0'))  # 29


# 25023 (Уровень: Базовый)
s = f'{768:b}'[::-1]
r = '01'[s[0] == '0']
q = 2
for i in s[1:]:
    if q == 2:
        r += '01'[i == '0']
        q = 3
    else:
        r += i
        q = 2
print(int(r[::-1], 2))  # 427


# 25024 (Уровень: Базовый)
# Легче руками делать
s = f'{204:b}'[::-1]
r = '01'[s[0] == '0']  # q1
fl = True
for i in s[1:]:
    if fl:  # q2
        if i == '1':
            r += '0'
        else:
            r += '1'
            fl = False
    else:  # q3
        if i == '1':
            r += '1'
        else:
            r += '0'
            fl = True
print(int(r[::-1], 2))  # 239


# 25025 (Уровень: Базовый) ❌ Не решено
# https://stepik.org/lesson/1038682/step/9?unit=1062773
# 542 >>> 703
# 992  >>> 1003
s = f'{992:b}'[::-1]
r = '01'[s[0] == '0']
fl = 2
for i in s[1:]:
    if fl == 2:
        r += '1'
        fl = (2, 3)[i == '0']
    else:
        r += '0'
        fl = (3, 2)[i == '0']
print(int(r[::-1], 2))  # (542 >>> 703)  (992  >>> 1003)
# print(r[::-1])



# 25071 (Уровень: Базовый)
for n in range(10_000 - 1, 0, -1):
    s = f'{n:b}'
    r = ''.join('1' if i == '0' else '0' for i in s)
    if int(r, 2) == 156:
        print(n)  # 8035
        break


# 25072 (Уровень: Базовый)
for n in range(30000-1, 0, -1):
    b = f'{n:b}'[::-1]
    r = ''.join(['0' if i == '1' else '1' for i in b])
    if int(r[::-1], 2) == 77:
        print(n)  # 16306
        break


# 25073 (Уровень: Базовый)
for n in range(70000-1, 0, -1):
    b = f'{n:b}'
    b = ''.join(['1' if i == '0' else '0' for i in b])
    if int(b, 2) == 415:
        print(n)  # 65120
        break


# 25302 (Уровень: Средний)  # очень легкий
start = '1' * 420 + '0' * 380
end = '1' * 420 + '0' * 380
# 380


# 25293 (Уровень: Средний)
start = '1' * 250 + '0' + '1' * 349
end = '0' * 250 + '1' + '1' * 349
# 349


# 25301 (Уровень: Средний)
start = '1' * 656 + '0' * 344
end = '1' * 656 + '0' * 343 + '1'
# 344



# 25351 ЕГКР 13.12.25 (Уровень: Базовый)
s = f'{2028:b}'
"""
11111101100     2028
1111110110000   8112
"""
print(int('1111110110000', 2))  # 8112


# 25599 (Уровень: Базовый)
s = f'{145:b}'
r = ''.join('1' if i == '0' else '0' for i in s)
# for i in s:
#     r += '01'[i == '0']
r += '10'
print(int(r, 2))  # 442


# 25606 (Уровень: Базовый)
s = f'{32:b}'
s = ''.join(['1' if i == '0' else '0' for i in s]) + '10'
print(int(s, 2))  # 126



# 26348 (Уровень: Базовый)
for n in range(1, 10000):
    b = ''.join(['1' if i == '0' else '0' for i in f'{n:b}']) + '10'
    if int(b, 2) == 794:
        print(n)  # 313
        break


# 27624 Апробация 04.03.26 (Уровень: Базовый)
s = f'{800:b}'
q = 2
r = ''
for i in range(len(s)):
    if q == 2:
        r += s[i]
        if s[i] == '1':
            q = 3
    elif q == 3:
        if s[i] == '0':
            r += s[i]
        else:
            r += '0'
            q = 4
    else:  # q == 4
        r += s[i]
print(int(r, 2))  # 544
# print(r)  # 1000100000


