""""""
"""
01. Графы. Анализ информационных моделей.
02. Таблицы истинности логических выражений.
03. Поиск и сортировка в базах данных.
04. Условие Фано. Кодирование и декодирование данных.
05. Анализ алгоритмов для исполнителей.
06. Turtle graphics. Циклические алгоритмы для Исполнителя.
07. Кодирование графической и звуковой информации.
08. Комбинаторика. Задания на перебор слов.
09. Обработка числовой информации в электронных таблицах.
10. Текстовый редактор. Поиск слова в текстовом документе.
11. Вычисление количества информации.
12. Машина Тьюринга.
13. IP адреса и маски.
14. Позиционные системы счисления. Преобразование числа в десятичную СС.
15. Истинность логического выражения.
16. Вычисление значения рекурсивной функции.
17. Обработка целочисленных данных. Проверка делимости.
18. Динамическое программирование в электронных таблицах.
19-21. Теория игр.
22. Табличный редактор. Многопоточные вычисления.
23. Динамическое программирование (количество программ).
24. Обработка символьных строк.
25. Обработка целочисленных данных. Поиск делителей.
26. Обработка данных с помощью сортировки.
27. Анализ данных.
"""