""""""
""" Расчёт медианы списка """
"""
Медианное число (или медиана) последовательности – это число, 
которое находится ровно посередине упорядоченной последовательности чисел. 
Если количество чисел в последовательности нечетное, то медиана – это центральное число. 
Если количество чисел четное, то медиана – это среднее арифметическое двух центральных чисел
"""
# Для четного и нечетного кол-ва элементов списка
from statistics import median, mean
num = [3, 1, 5, 2]
med = median(num)  # 2.5  - значение медианы

# Только для нечетного кол-ва элементов списка
ls = sorted([1, 3, 2, 5, 4])
med = ls[len(ls) // 2]  # 3


""" Перемножить элементы списка """
# Перемножить элементы списка - var 1
from math import prod  # С версии Python 3.8

res = prod([2, 3, 4])  # 24

# Перемножить элементы списка - var 2
from functools import reduce
from operator import mul

res = reduce(mul, [2, 3, 4])  # 24


""" Создание словаря для подсчета значений """

from collections import Counter  # аналог dict()
f = [1, 1, 5, 5, 2, 'a', 'a', 'a']
d = Counter(f)
print(d.most_common()) # [('a', 3), (1, 2), (5, 2), (2, 1)]
print(d.most_common(1)) # [('a', 3)]


D = dict()
for i in f:
    D.setdefault(i, 0)
    D[i] += 1
D = sorted((v, k) for k, v in d.items())
print(D)  # [(1, 2), (2, 1), (2, 5), (3, 'a')]
print(D[-1])  # (3, 'a')


f = open('26.txt').read().splitlines()  # получить список строк без \n


# Классическая матрешка (коробки, трубы и т.д.)
d = [43, 40, 40, 32, 30]
cur, cnt = d[0], 1
dif = 3
for i in d:
    if cur - i >= dif:
        cnt += 1
        cur = i
print(cnt, cur)  # 3 32