""" Task 15 FAQ """

"""
Для гарантии лучше каждое выражение брать в скобки


A -> B      not A or B
A -> B      A <= B

A /\ B      and
A \/ B       or


not (A * B)  ==  not A  or  not B

not (A or B)  ==  not A  *  not B

(A or B) * (A or C)  ==  A or (B * C)



побитовое умножение
A & B

14 & 5 = 0b1110 & 0b0101 = 0b0100 = 4
1110
0101
-----
0100

"""


"""
диапазон НЕ включительно границы (от  0  до  5)
[_ * 0.5 for _ in range(1, 5*2)]
[0.5, 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 4.5]


диапазон ВКЛЮЧИТЕЛЬНО границы (от  0  до  5)
f = [_ * 0.5 for _ in range(5*2)]
f.append(5)
[0.0, 0.5, 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 4.5, 5.0]
"""
