""""""
"""
умножение числа на основание добавляет цифру 0 в число 
( 5 * 10 = 50 )

целочисленное деление числа на основание убирает последнюю цифру их числа 
( 53 //10 = 5 )

остаток от деления на основание возвращает последнюю цифру числа 
( 53 % 10 = 3 )

число 10n состоит в десятичной системе счисления из единицы и n нулей 
( 103 = 1000 )

число 10n-1 состоит из n девяток 
( 103 - 1 = 999  - три девятки )

число 10n - 10k состоит из n-k девяток, за которыми справа стоят k нулей: 
( 105 - 102 = 99900  - три девятки и два нуля )

число 2**n состоит в двоичной системе счисления из единицы и n нулей 
( 23 = 10002 )

число 2**n - 1 состоит из n единиц 
( 23 - 1 = 1112  - три единицы )

число 2**n - 2**k состоит из n-k единиц, за которыми справа стоят k нулей: 
( 25-22 = 11100 - три единицы и два нуля )
"""