""""""
"""
умножение числа на основание добавляет цифру 0 в число 
( 5 * 10 = 50 )

целочисленное деление числа на основание убирает последнюю цифру их числа 
( 53 //10 = 5 )

остаток от деления на основание возвращает последнюю цифру числа 
( 53 % 10 = 3 )

число 10n состоит в десятичной системе счисления из единицы и n нулей 
( 10**3 = 1000 )

число 10**n - 1 состоит из n девяток 
( 10**3 - 1 = 999  - три девятки )

число 10**n - 10**k состоит из n-k девяток, за которыми справа стоят k нулей: 
( 10**5 - 10**2 = 99900  - три девятки и два нуля )

число 2**n состоит в двоичной системе счисления из единицы и n нулей 
( 2**3 = '1000' )

число 2**n - 1 состоит из n единиц 
( 2**3 - 1 = '111'  - три единицы )

число 2**n - 2**k состоит из n-k единиц, за которыми справа стоят k нулей: 
( 2**5 - 2**2 = 11100 - три единицы и два нуля )
"""